FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/РассчитатьKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РассчитатьKPI</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/РассчитатьKPI/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		
		Объект.Период=НачалоМесяца(КонецГода(Объект.Период));
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		
		Объект.Период=НачалоМесяца(КонецКвартала(Объект.Период));
		ДатаПланирования=Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли ПустаяСтрока(Объект.Периодичность) Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);
		
	Иначе
		
		Сообщить("Неверная периодичность!");
		Объект.Периодичность="";
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
	    Мотивация.ДатаКакМесяцПодобратьДатуПоТексту(ДатаПланирования, Объект.Период);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.Период);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.Период<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.Период)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.Период)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.Период=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.Период=НачалоМесяца(КонецКвартала(Объект.Период));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.Период<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.Период)-3;
			КонГод=Год(Объект.Период)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.Период=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		Объект.Период = ДобавитьМесяц(Объект.Период, Направление);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Направление>0 Тогда
			Объект.Период=ДобавитьМесяц(Объект.Период,3);
		Иначе
			Объект.Период=ДобавитьМесяц(Объект.Период,-3);
		КонецЕсли;
		
		ДатаПланирования = Формат(Объект.Период,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Направление>0 Тогда
			Объект.Период=ДобавитьМесяц(Объект.Период,12);
		Иначе
			Объект.Период=ДобавитьМесяц(Объект.Период,-12);
		КонецЕсли;
		
		ДатаПланирования=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ПериодПланирования, СтандартнаяОбработка, ПериодРегистрации, НачальноеЗначение = Неопределено, МинГод=Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	
	Если НЕ МинГод=Неопределено Тогда
		Если НачалоПрошлогоГода<МинГод Тогда
			НачалоПрошлогоГода =МинГод;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		Если НЕ МинГод=Неопределено Тогда
			
			Если НачалоМесяцазаполнения<МинГод Тогда
				НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Мотивация.ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПериодПланирования",ПериодПланирования);
	ДопПараметры.Вставить("МинГод",МинГод);
	ДопПараметры.Вставить("НачальноеЗначение",НачальноеЗначение);
	ДопПараметры.Вставить("СтандартнаяОбработка",СтандартнаяОбработка);
	ДопПараметры.Вставить("ПериодРегистрации",ПериодРегистрации);
	
    ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры), СписокВыбора, ПериодПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(ДополнительныеПараметры.НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДополнительныеПараметры.ПериодПланирования, ДополнительныеПараметры.СтандартнаяОбработка, ДополнительныеПараметры.ПериодРегистрации, ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МинГод);
		Возврат;
	КонецЕсли;
	
	Объект.Период = ВыбранныйЭлемент.Значение;
	ДатаПланирования  = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодичностьПриИзменении(Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Если ПустаяСтрока(Объект.Периодичность) 
		ИЛИ Объект.Период = Дата('00010101') Тогда 
		Сообщить("Не заполнен период расчета или периодичность");
		Возврат;
	КонецЕсли;
	
	Обработки.РассчитатьKPI.Сформировать(Объект.Период, Объект.Периодичность, Объект.Организация, Объект.ПодразделениеКомпании);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период = НачалоМесяца(ТекущаяДата());
	
	Объект.Периодичность = Перечисления.Периодичность.Месяц;

	ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

	Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;

КонецПроцедуры
